# Taller

En este taller trabajará con dos dataset  'title.csv' y 'cast.csv'. El archivo 'title.csv' contiene la lista de películas con el año de estreno; mientras que el archivo 'cast.csv' tiene cinco columnas que almacenan el título de la película, año de estreno, elenco de estrellas, tipo (actor / actriz), personajes y calificaciones de los actores, como se muestra a continuación,

In [100]:
#En esta celda se van a dejar  las librerías que usará a lo largo del taller
import pandas as pd
import numpy as np

In [2]:
# Cargas los dos datasets
title = pd.read_csv('titles.csv')

In [ ]:
cast   = pd.read_csv('cast.csv')

In [ ]:
#Despliegue una muestra del dataset title (head, tail, sample)

In [4]:
title.head()

                                   title  year
0                                 Mahler  1974
1           Ogon, voda i... mednye truby  1968
2  Ana Nojoom bent alasherah wamotalagah  2014
3                      Malu de Bicicleta  2010
4             Nazareno Apostol: Boy Ahas  1989

In [5]:
title.tail()

                       title  year
230402         El lobo negro  1981
230403  Komu na Rusi zhit...  1989
230404              Senotaji  2013
230405     The Leopard Woman  1920
230406    Mio caro assassino  1972

In [6]:
title.sample(10)

                                            title  year
201396                              Captain Trips  2020
142267                                 SuperOutro  1989
174419                           My First Miracle  2016
203072                               Gudang Kubur  2015
226225             De Ontmaagding van Eva van End  2012
20764                 The Low Budget Time Machine  2003
113172                                    Hire Up  2016
210617                                Silver Cove  2014
88507   Scissor Sisters: Hurrah! A Year of Ta-Dah  2007
4837                                 Captain Fury  1939

In [7]:
title.describe()

                year
count  230407.000000
mean     1985.810522
std        29.361496
min      1894.000000
25%      1966.000000
50%      1996.000000
75%      2011.000000
max      2024.000000

In [4]:
#Despliegue una muestra del dataset cast  (head, tail, sample)

In [5]:
#Cuantos nomrbes de peliculas hay en title y cuantos son distintos

In [8]:
print(f"Cantidad {len(title.title)}")

Cantidad 230407

In [9]:
title.title.count()

230407

In [10]:
print(f"Distintos {len(title.title.unique())}")

Distintos 210691

In [124]:
#Cuantas peliculas por año en el dataset titles y cuantas en el dataset cast
movies_years = title.groupby(["year"]).count()
movies_years

      title
year
1894      1
1898      1
1899      1
1900      4
1903      1
1905      2
1906      5
1907      4
1908      6
1909     15
1910     22
1911     58
1912    107
1913    246
1914    549
1915    877
1916   1167
1917   1197
1918   1090
1919   1139
1920   1112
1921    968
1922    892
1923    725
1924    799
1925    880
1926    866
1927    869
1928    887
1929    753
...     ...
1995   2079
1996   2093
1997   2291
1998   2376
1999   2485
2000   2722
2001   2828
2002   2946
2003   3107
2004   3437
2005   3928
2006   4178
2007   4336
2008   5004
2009   6010
2010   6253
2011   6867
2012   7241
2013   7647
2014   8068
2015   8710
2016  14385
2017   6417
2018   1500
2019    286
2020    104
2021     15
2022     12
2023     10
2024      1

[125 rows x 1 columns]

In [21]:
# cuantas peliculas tienen por nombre "Hamlet"
title[title.title == "Hamlet"].title.count()

19

In [35]:
#Cuantas peliculas son de nombre "Carmen" y son de antes de 1950
title.loc[(title.title == "Carmen") & (title.year < 1950)].title.count()

8

In [45]:
# Titulos mas comunes en la historia filmografica
title["title"].value_counts()[:10]

Hamlet                  19
Carmen                  16
Macbeth                 15
The Three Musketeers    11
Hero                    11
Othello                 11
The Outsider            11
Maya                    11
Kismet                  10
Temptation              10
Name: title, dtype: int64

In [75]:
# Cual fue la primer pelicula hecha titulada "Romeo and Juliet"
title[title.title == "Romeo and Juliet"].min()

title    Romeo and Juliet
year                 1916
dtype: object

In [82]:
# Listar todas las peliculas que contengan la palabra "Exorcist" 
title[title.title.str.contains('Exorcist')].sort_values(by ='year', ascending = True)
# ordenadas de la mas antigua a la mas reciente

                                         title  year
88003                             The Exorcist  1973
49658                  O Exorcista de Mulheres  1974
140519                Exorcist II: The Heretic  1977
220073                        Kung Fu Exorcist  1978
17375                         The Exorcist III  1990
132451                        Teenage Exorcist  1991
117797                 Exorcist: The Beginning  2004
94189        Dominion: Prequel to the Exorcist  2005
209250  Costa Chica: Confession of an Exorcist  2006
86354                      Exorcist Chronicles  2007
130686                      The Disco Exorcist  2011
57932                      Exorcist Chronicles  2013
69974                           Shark Exorcist  2015
51101                            Bad Exorcists  2015
151850                              Exorcistas  2015
60700                      Accidental Exorcist  2016
161093                       American Exorcist  2016
195615                    Diary of an Exorcist  2016
228642                  Exorcist House of Evil  2016

In [86]:
# Cuantas peliculas fueron hechas en el año 1950?
title[title.year == 1950].title.count()

1081

In [88]:
# Cuantas peliculas fueron despues del año 1970?
title[title.year > 1970].title.count()

164559

In [117]:
# Cuantas peliculas fueron hechas de 1970 a 1979
values = range(1970,1979)
title[title.year.isin(values)].year.count()

16684

Ahora se trabajara con el dataset de cast, importante tambien tener en cuneta que e sun dataset que se tendra que limpiar con el paso de las clases y dejarlo lo mas optimo posible

In [15]:
# Cuantos roles o papeles hubo en la pelicula "The Godfather"

#Doy la solución a este punto para que vean que es lo que se pide

len(cast.loc[cas.title == "The Godfather"])

NameError: name 'cast' is not defined

In [ ]:
# Cuantos papeles en la pelicula "The Godfather" no estan clasificados en algun valor "n"

In [ ]:
# Cuantos papeles en la pelicula "The Godfather" si estuvieron clasificados con un valor "n"

In [ ]:
# Mostrar el elenco completo de la pelicula "2001: A Space Odyssey" 
# ordenado por su clasificasión "n", ignorando los papeles que no se les asigno ningun valor "n"

In [ ]:
# Mostrar el elenco completo ordenado por la clasificacion "n"
# de la pelicula "Dracula" de 1958

In [ ]:
# Cuantos papeles de "Bruce Wayne" han sido hechos en la historia  de las peliculas (papeles hace referencia a la coulumna character)